Tekla.Structures.CatalogInternal.CDelegateSetter
This class is purely available for the reason to enable faking of
ICDelegate interface for the sake of testing.

Tekla.Structures.CatalogInternal.CDelegateSetter.SetInstanceForUnitTesting(Tekla.Structures.CatalogInternal.ICDelegate)
Set the current ICDelegate instance to your fake/mock class.
The instance must be restored to null when test method ends.
cdelegate: The delegate implementation